[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.js:76:61
     );
   }
 
-  recommendationRequests.forEach((recommendationRequest) => {
-    recommendationRequest.done = String(recommendationRequest.done);
-  });
+  recommendationRequests.forEach((recommendationRequest) => {});
 
   return (
killedBy: RecommendationRequestTable tests Has the expected column headers, content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
