[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New Recommendation Request Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail} professorEmail: ${recommendationRequest.professorEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Recommendation Request Created - id: 14 requesterEmail: requesterEmail14@ucsb.edu professorEmail: professorEmail14@ucsb.edu"

Number of calls: 0
