[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:43:15
       accessor: "requesterEmail",
     },
     {
-      Header: "Team Id",
+      Header: "",
       accessor: "teamId",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Team Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:47:15
       accessor: "teamId",
     },
     {
-      Header: "Table/Breakout Room",
+      Header: "",
       accessor: "tableOrBreakoutRoom",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table/Breakout Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:72:34
       ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"),
     );
   }
-  requests.forEach((requests) => {
-    requests.solved = String(requests.solved);
-  });
+  requests.forEach((requests) => {});
   return (
     <OurTable data={requests} columns={columns} testid={"HelpRequestTable"} />
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
