[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "LocalDateTime is required."}
+              {errors.dateAdded || "LocalDateTime is required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "LocalDateTime is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
