[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:11:13
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
+    params: {},
   });
 
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "dateAdded": "2024-02-02T00:00",
-   "email": "ajayliu@ucsb.edu",
