[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      id: article.id,
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Article Updated - id: 17 title: lolol2 title"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:34:11
     params: {
       id: article.id,
     },
-    data: {
-      id: article.id,
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"id\":17,\"title\":\"lolol2 title\",\"url\":\"https://www.google2.com/\",\"explanation\":\"This is an article2\",\"email\":\"ajayliu@ucsb.edu2\",\"dateAdded\":\"2026-02-02T00:00\"}"
Received: "{}"

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            initialContents={article}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            initialContents={article}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {article || <ArticlesForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="ArticlesForm-title" id="title" name="title" type="text" /> instead
